"""

已知数据格式案例
华为: 1.202112314787104768_202105105828660224_18.128.64.50_HW_NE5000E.20211231101029.631
     2.202112314787104768_202105105820271616_18.128.65.50_HW_NE8000.20211231095645.442
     共两台设备
     以1为例 可以分割为 :
     一.202112314787104768
     二.202105105828660224
     三.128.64.50_HW_NE5000E 设备名
     四.20211231101029 时间 2021/12/31 10:10:29
     五.631



华三: 202112313324071936_202105104766102528_18.128.64.173_H3_VBRAS1000.20211231095648.313


"""

def print_hi(name):
    # 在下面的代码行中使用断点来调试脚本。
    print(f'Hi, {name}')  # 按 Ctrl+F8 切换断点。


# 按间距中的绿色按钮以运行脚本。
if __name__ == '__main__':
    print_hi('PyCharm')

# 访问 https://www.jetbrains.com/help/pycharm/ 获取 PyCharm 帮助
